; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   sinkbasintype microwavetype fridgetype - receptacletype
   butterknifetype knifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   cabinettype diningtabletype toilettype drawertype shelftype bedtype safetype - receptacletype
   pentype pillowtype mugtype plungertype cuptype tomatotype soapbottletype bowltype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 location6 location7 location8 - location
   microwave_1 cabinet_2 diningtable_3 toilet_4 drawer_5 shelf_6 bed_7 safe_8 microwave_9 fridge_10 - receptacle
   pen_1 pillow_2 mug_3 plunger_4 cup_5 tomato_6 soapbottle_7 bowl_8 - obj
 )
 (:init (receptacletype_0 microwave_1 microwavetype) (receptacletype_0 cabinet_2 cabinettype) (receptacletype_0 diningtable_3 diningtabletype) (receptacletype_0 toilet_4 toilettype) (receptacletype_0 drawer_5 drawertype) (receptacletype_0 shelf_6 shelftype) (receptacletype_0 bed_7 bedtype) (receptacletype_0 safe_8 safetype) (receptacletype_0 microwave_9 microwavetype) (receptacletype_0 fridge_10 fridgetype) (objecttype_0 pen_1 pentype) (objecttype_0 pillow_2 pillowtype) (objecttype_0 mug_3 mugtype) (objecttype_0 plunger_4 plungertype) (objecttype_0 cup_5 cuptype) (objecttype_0 tomato_6 tomatotype) (objecttype_0 soapbottle_7 soapbottletype) (objecttype_0 bowl_8 bowltype) (cancontain microwavetype mugtype) (cancontain microwavetype cuptype) (cancontain microwavetype tomatotype) (cancontain microwavetype bowltype) (cancontain cabinettype mugtype) (cancontain cabinettype plungertype) (cancontain cabinettype cuptype) (cancontain cabinettype soapbottletype) (cancontain cabinettype bowltype) (cancontain diningtabletype pentype) (cancontain diningtabletype mugtype) (cancontain diningtabletype cuptype) (cancontain diningtabletype tomatotype) (cancontain diningtabletype soapbottletype) (cancontain diningtabletype bowltype) (cancontain toilettype soapbottletype) (cancontain drawertype pentype) (cancontain drawertype soapbottletype) (cancontain shelftype pentype) (cancontain shelftype mugtype) (cancontain shelftype cuptype) (cancontain shelftype soapbottletype) (cancontain shelftype bowltype) (cancontain bedtype pillowtype) (cancontain fridgetype mugtype) (cancontain fridgetype cuptype) (cancontain fridgetype tomatotype) (cancontain fridgetype bowltype) (pickupable pen_1) (pickupable pillow_2) (pickupable mug_3) (isreceptacleobject mug_3) (cleanable mug_3) (heatable mug_3) (coolable mug_3) (pickupable plunger_4) (pickupable cup_5) (isreceptacleobject cup_5) (cleanable cup_5) (heatable cup_5) (coolable cup_5) (pickupable tomato_6) (cleanable tomato_6) (heatable tomato_6) (coolable tomato_6) (sliceable tomato_6) (pickupable soapbottle_7) (pickupable bowl_8) (isreceptacleobject bowl_8) (cleanable bowl_8) (coolable bowl_8) (receptacleatlocation microwave_1 location4) (receptacleatlocation cabinet_2 location2) (receptacleatlocation diningtable_3 location7) (receptacleatlocation toilet_4 location1) (receptacleatlocation drawer_5 location2) (receptacleatlocation shelf_6 location4) (receptacleatlocation bed_7 location1) (receptacleatlocation safe_8 location7) (receptacleatlocation microwave_9 location1) (receptacleatlocation fridge_10 location4) (inreceptacle pen_1 diningtable_3) (inreceptacle pillow_2 bed_7) (inreceptacle mug_3 diningtable_3) (inreceptacle plunger_4 cabinet_2) (inreceptacle cup_5 fridge_10) (inreceptacle tomato_6 microwave_9) (inreceptacle soapbottle_7 diningtable_3) (inreceptacle bowl_8 cabinet_2) (objectatlocation pen_1 location7) (objectatlocation pillow_2 location1) (objectatlocation mug_3 location7) (objectatlocation plunger_4 location2) (objectatlocation cup_5 location4) (objectatlocation tomato_6 location1) (objectatlocation soapbottle_7 location7) (objectatlocation bowl_8 location2) (atlocation agent1 location4) (= (total-cost) 0))
 (:goal (and (exists (?r - receptacle)
 (exists (?o1 - obj)
 (and (inreceptacle ?o1 ?r) (objecttype_0 ?o1 mugtype) (receptacletype_0 ?r cabinettype) (exists (?o2 - obj)
 (and (not (= ?o1 ?o2)) (objecttype_0 ?o2 plungertype) (receptacletype_0 ?r cabinettype) (inreceptacle ?o2 ?r))))))))
 (:metric minimize (total-cost))
)

; plan
1. (gotolocation agent1 location4 location7)
   deleted: (atlocation agent1 location4)
   added: (atlocation agent1 location7)
   goals met: 0 of 1
2. (pickupobject agent1 location7 mug_3 diningtable_3)
   deleted: (inreceptacle mug_3 diningtable_3) (objectatlocation mug_3 location7)
   added: (holds agent1 mug_3) (holdsany agent1)
   goals met: 0 of 1
3. (gotolocation agent1 location7 location2)
   deleted: (atlocation agent1 location7)
   added: (atlocation agent1 location2)
   goals met: 0 of 1
4. (putobject agent1 location2 mug_3 cabinet_2 mugtype cabinettype)
   deleted: (holds agent1 mug_3) (holdsany agent1)
   added: (inreceptacle mug_3 cabinet_2) (objectatlocation mug_3 location2)
   goals met: 1 of 1
